src/Documents/УстановкаТарифовПоНаравлениям/УстановкаТарифовПоНаравлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТарифовПоНаравлениям</name>
  <registerRecords>InformationRegister.ТарифыПоНаправлениям</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тарифы</name>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Откуда</name>
      <type>
        <types>CatalogRef.ТарифнаяГруппа</types>
      </type>
    </attributes>
    <attributes>
      <name>Куда</name>
      <type>
        <types>CatalogRef.ТарифнаяГруппа</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ТарифыПоНаправлениям/ТарифыПоНаправлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыПоНаправлениям</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Откуда</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Куда</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТарифнаяГруппа/ТарифнаяГруппа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТарифнаяГруппа</name>
  <tabularSections>
    <name>ГородаСП</name>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.ГородаСП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/УстановкаТарифовПоНаравлениям/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаТарифовПоНаравлениямТарифы.Габарит,
		|	УстановкаТарифовПоНаравлениямТарифы.Стоимость,
		|	ТарифнаяГруппаКуда.Город КАК Куда,
		|	ТарифнаяГруппаОткуда.Город КАК Откуда,
		|	УстановкаТарифовПоНаравлениямТарифы.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.УстановкаТарифовПоНаравлениям.Тарифы КАК УстановкаТарифовПоНаравлениямТарифы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифнаяГруппа.ГородаСП КАК ТарифнаяГруппаОткуда
		|		ПО УстановкаТарифовПоНаравлениямТарифы.Откуда = ТарифнаяГруппаОткуда.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифнаяГруппа.ГородаСП КАК ТарифнаяГруппаКуда
		|		ПО УстановкаТарифовПоНаравлениямТарифы.Куда = ТарифнаяГруппаКуда.Ссылка
		|ГДЕ
		|	УстановкаТарифовПоНаравлениямТарифы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Движения.ТарифыПоНаправлениям.Записывать = Истина;
	Движения.ТарифыПоНаправлениям.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры
